In [7]:
people={
    'first':['aravind','rahul','jake'],
    'last':['reddy','reddy','chris'],
    'email':['malluriaravindreddy@gmail.com','rahul15@gmail.com','jakechris@gmail.com']
}

In [8]:
import pandas as pd

In [21]:
df=pd.DataFrame(people)

In [22]:
df

     first   last                          email
0  aravind  reddy  malluriaravindreddy@gmail.com
1    rahul  reddy              rahul15@gmail.com
2     jake  chris            jakechris@gmail.com

In [23]:
#adding the columns
#if we want to add firstname and lastname
df['first']+' '+df['last']

0    aravind reddy
1      rahul reddy
2       jake chris
dtype: object

In [24]:
# if we want to add this a column in a dataframe
df['fullname']=df['first']+' '+df['last']

In [25]:
df

#note: we do not want to use the dot notation like df.fullname,python will think we are assigning an attribute not as 
#a column. for to avoid such cases we will use the brakcets

     first   last                          email       fullname
0  aravind  reddy  malluriaravindreddy@gmail.com  aravind reddy
1    rahul  reddy              rahul15@gmail.com    rahul reddy
2     jake  chris            jakechris@gmail.com     jake chris

In [27]:
# removing the columns we can use drop method
df.drop(columns=['first','last']) # we are using the list here because we are passing multiple columns.


#this just gives us a view of what our dataframe would look like but it actually does not apply those changes if we are
# happy with these changes then we can set the inplace argument to true. so that it changes the data frame inplace

                           email       fullname
0  malluriaravindreddy@gmail.com  aravind reddy
1              rahul15@gmail.com    rahul reddy
2            jakechris@gmail.com     jake chris

In [28]:
df.drop(columns=['first','last'], inplace=True)

In [29]:
df

                           email       fullname
0  malluriaravindreddy@gmail.com  aravind reddy
1              rahul15@gmail.com    rahul reddy
2            jakechris@gmail.com     jake chris

In [30]:
df['fullname'].str.split(' ')

0    [aravind, reddy]
1      [rahul, reddy]
2       [jake, chris]
Name: fullname, dtype: object

In [31]:
df['fullname'].str.split(' ',expand=True)
#everything that was in list split up into columns

         0      1
0  aravind  reddy
1    rahul  reddy
2     jake  chris

In [32]:
#how to add these columns and combine to the previous dataframe
df[['first','last']]=df['fullname'].str.split(' ',expand=True)

In [33]:
df

                           email       fullname    first   last
0  malluriaravindreddy@gmail.com  aravind reddy  aravind  reddy
1              rahul15@gmail.com    rahul reddy    rahul  reddy
2            jakechris@gmail.com     jake chris     jake  chris

In [34]:
#adding and remving the rows of data

In [35]:
#Adding single row of data so we can do this by using append method
df.append({'first':'anil'})

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [37]:
df.append({'first':'anil'},ignore_index=True)

                           email       fullname    first   last
0  malluriaravindreddy@gmail.com  aravind reddy  aravind  reddy
1              rahul15@gmail.com    rahul reddy    rahul  reddy
2            jakechris@gmail.com     jake chris     jake  chris
3                            NaN            NaN     anil    NaN

In [38]:
#now we have a dataframe that would like to append to our existing data frame we can do that as well
people={
    'first':['thor','chris'],
    'last':['hemsworth','evan'],
    'email':['thorhemsworthy@gmail.com','chrisevan@gmail.com',]
}
df2=pd.DataFrame(people)

In [45]:
df2

   first       last                     email
0   thor  hemsworth  thorhemsworthy@gmail.com
1  chris       evan       chrisevan@gmail.com

In [47]:
# if we want to add this new dataframe to existing dataframe we can use append()
df.append(df2,ignore_index=True,sort=False)

                           email       fullname    first       last
0  malluriaravindreddy@gmail.com  aravind reddy  aravind      reddy
1              rahul15@gmail.com    rahul reddy    rahul      reddy
2            jakechris@gmail.com     jake chris     jake      chris
3       thorhemsworthy@gmail.com            NaN     thor  hemsworth
4            chrisevan@gmail.com            NaN    chris       evan

In [48]:
#if we want to permanent these changes we will not use inplace=true here
df=df.append(df2,ignore_index=True,sort=False)

In [49]:
df

                           email       fullname    first       last
0  malluriaravindreddy@gmail.com  aravind reddy  aravind      reddy
1              rahul15@gmail.com    rahul reddy    rahul      reddy
2            jakechris@gmail.com     jake chris     jake      chris
3       thorhemsworthy@gmail.com            NaN     thor  hemsworth
4            chrisevan@gmail.com            NaN    chris       evan

In [50]:
#removing the rows
df.drop(index=4)

                           email       fullname    first       last
0  malluriaravindreddy@gmail.com  aravind reddy  aravind      reddy
1              rahul15@gmail.com    rahul reddy    rahul      reddy
2            jakechris@gmail.com     jake chris     jake      chris
3       thorhemsworthy@gmail.com            NaN     thor  hemsworth

In [56]:
filt=df['last']=='reddy'
df.drop(index=df[filt].index)

                      email    fullname  first       last
2       jakechris@gmail.com  jake chris   jake      chris
3  thorhemsworthy@gmail.com         NaN   thor  hemsworth
4       chrisevan@gmail.com         NaN  chris       evan